# 列表：切片
"""
1. 介绍：切片是一种通过索引范围获取序列子集的操作。
    序列：列表、元祖、字符串等
    操作：这个操作不仅仅是获取，还可以是修改或删除等
2. 语法：sequence[start:stop:step] --> 序列索引[开始索引:结束索引:步长]
    start 不指定默认为 0，stop 不指定默认列表长度，step 不指定默认为 1
    序列索引可为正向，也可为反向 s[::-1]，相当于根据原序列生成一个反向排序的新序列
3. 举例
    str = ["a", "b", "c", "d", "e", "f", "g", "h", "i"]
    str[0:5:1] = ["a", "b", "c", "d", "e"]
    str[0:5:] = ["a", "b", "c", "d", "e"]
    str[0:5] = ["a", "b", "c", "d", "e"]
    str[:5] = ["a", "b", "c", "d", "e"]
    str[:-4] = ["a", "b", "c", "d", "e"]

    str[0:5:2] = ["a", "c", "e"]
    str[:5:2] = ["a", "c", "e"]
    str[::-1] = ['i', 'h', 'g', 'f', 'e', 'd', 'c', 'b', 'a']

"""
str = ["a", "b", "c", "d", "e", "f", "g", "h", "i"]

print(str[::])

print(str[::-1])

print(str[:-4])

str1 =  ["a", "b", "c", "d", "e", "f", "g", "h", "i"]
str1[4::] = ["RE", "RE", "RE", "RE", "RE"] # ['a', 'b', 'c', 'd', 'RE', 'RE', 'RE', 'RE', 'RE']
print(str1)

str2 =  ["a", "b", "c", "d", "e", "f", "g", "h", "i"]
str2[4::] = ["RE"] # ['a', 'b', 'c', 'd', 'RE']
print(str2)

str[4::2] = ["RE", "RG", "RI"]  # ['a', 'b', 'c', 'd', 'RE', 'f', 'RG', 'h', 'RI']
print(str)
